Revit 2024 API
FileExportingEventArgs Class
 The event arguments used by the FileExporting event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2010
Syntax
C#
public class FileExportingEventArgs : RevitAPIPreDocEventArgs
Visual Basic
Public Class FileExportingEventArgs _
	Inherits RevitAPIPreDocEventArgs
Visual C++
public ref class FileExportingEventArgs : public RevitAPIPreDocEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.FileExportingEventArgs
See Also
FileExportingEventArgs Members
Autodesk.Revit.DB.Events Namespace